#include <iostream>
using namespace std;
int main()
{
	setlocale(LC_ALL, "Russian");
	double a[3][3];
	for (int i = 0; i < 3; i++)
	{
		for (int j = 0; j < 3; j++)
		{
			cout << "Введите элемент [" << i + 1 << "] [" << j + 1 << "] " << endl;
			cin >> a[i][j];
		}
	}
	double b[3], l[3][3];
	cout << "Введите правый столбец " << endl;
	for (int i = 0; i < 3; i++)
	{
		cin >> b[i];
	}
	l[0][0] = sqrt(a[0][0]);
	l[1][0] = a[0][1] / l[0][0];
	l[2][0] = a[0][2] / l[0][0];
	l[1][1] = sqrt(a[1][1] - pow(l[1][0], 2));
	l[2][1] = (a[2][1] - l[1][0] * l[1][1]) / l[1][1];
	l[2][2] = sqrt(a[2][2] - pow(l[2][0], 2) - pow(l[2][1], 2));
	l[0][1] = 0;
	l[0][2] = 0;
	l[1][2] = 0;
	double y[3];
	y[0] = b[0] / l[0][0];
	y[1] = (b[1] - l[1][0] * y[0]) / l[1][1];
	y[2] = (b[2] - l[2][0] * y[0] - l[2][1] * y[1]) / l[2][2];
	double x[3];
	x[2] = y[2] / l[2][2];
	x[1] = (y[1] - l[2][1] * x[2]) / l[1][1];
	x[0] = (y[0] - l[1][0] * x[1] - l[2][0] * x[2]) / l[0][0];
	cout << "Корни: " << x[0] << ", " << x[1] << ", " << x[2] << endl;
}
